# Выведите первый и последний элемент списка.

list = [1, 2, 'peach']

first = list[0]
print(list)

list.reverse()
last = list[0]

print(f'Первый элемент списка: {first}')
print(f'Последний элемент списка: {last}')