# Напишите программу на Python, которая принимает имя и фамилию пользователя и печатает их в обратном порядке с пробелом между ними.

fio = input('Введите имя и фамилию: ').title()
print(fio)

reversed(fio)


