# Напишите программу на Python для расчета длины строки.

s = input('Строка: ')

print(f'Длина строки: {len(s)}')